In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [7]:
amazon_df = pd.read_csv('/content/drive/MyDrive/ca.webinars/Pandas Series/data/amzn.csv', index_col=0, parse_dates=['Date'])
tesla_df = pd.read_csv('/content/drive/MyDrive/ca.webinars/Pandas Series/data/tsla.csv', index_col=0, parse_dates=['Date'])

In [8]:
amazon_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 147 entries, 0 to 146
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    147 non-null    datetime64[ns]
 1   Close   147 non-null    float64
 2   Volume  147 non-null    int64
 3   Symbol  147 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 5.7+ KB

In [11]:
df = pd.concat([amazon_df, tesla_df]).sort_values(by=['Date', 'Symbol'], ascending=True).reset_index(drop=True)

In [12]:
df.head()

        Date        Close      Volume Symbol
0 2020-07-01  2878.699951   6363400.0   AMZN
1 2020-07-01   223.925995  66634500.0   TSLA
2 2020-07-02  2890.300049   6593400.0   AMZN
3 2020-07-02   241.731995  86250500.0   TSLA
4 2020-07-06  3057.040039   6880600.0   AMZN

In [13]:
# 1. PIVOT

In [ ]:
# df.drop(["drop the columns you don't want"], axis=1)

In [16]:
pivot_df = pd.pivot(data=df, index='Date', columns='Symbol', values=['Close', 'Volume']).sort_index()

In [17]:
pivot_df.head(10)

                  Close                 Volume
Symbol             AMZN        TSLA       AMZN         TSLA
Date
2020-07-01  2878.699951  223.925995  6363400.0   66634500.0
2020-07-02  2890.300049  241.731995  6593400.0   86250500.0
2020-07-06  3057.040039  274.316010  6880600.0  102849500.0
2020-07-07  3000.120117  277.971985  5257500.0  107448500.0
2020-07-08  3081.110107  273.175995  5037600.0   81556500.0
2020-07-09  3182.629883  278.855988  6388700.0   58588000.0
2020-07-10  3200.000000  308.929993  5486000.0  116688000.0
2020-07-13  3104.000000  299.411987  7720400.0  194927000.0
2020-07-14  3084.000000  303.359985  7231900.0  117090500.0
2020-07-15  3008.870117  309.201996  5788900.0   81839000.0

In [21]:
pivot_df_new = pd.pivot(data=df, index='Date', columns='Symbol', values='Close').sort_index()

In [22]:
pivot_df_new.head(10)

Symbol             AMZN        TSLA
Date
2020-07-01  2878.699951  223.925995
2020-07-02  2890.300049  241.731995
2020-07-06  3057.040039  274.316010
2020-07-07  3000.120117  277.971985
2020-07-08  3081.110107  273.175995
2020-07-09  3182.629883  278.855988
2020-07-10  3200.000000  308.929993
2020-07-13  3104.000000  299.411987
2020-07-14  3084.000000  303.359985
2020-07-15  3008.870117  309.201996

In [20]:
# 2. UNSTACK

In [24]:
another_df = df.set_index(['Date', 'Symbol'])

In [25]:
another_df.head()

                         Close      Volume
Date       Symbol
2020-07-01 AMZN    2878.699951   6363400.0
           TSLA     223.925995  66634500.0
2020-07-02 AMZN    2890.300049   6593400.0
           TSLA     241.731995  86250500.0
2020-07-06 AMZN    3057.040039   6880600.0

In [27]:
another_df.drop(['Volume'], axis=1).unstack(level='Symbol').head(10)

                  Close
Symbol             AMZN        TSLA
Date
2020-07-01  2878.699951  223.925995
2020-07-02  2890.300049  241.731995
2020-07-06  3057.040039  274.316010
2020-07-07  3000.120117  277.971985
2020-07-08  3081.110107  273.175995
2020-07-09  3182.629883  278.855988
2020-07-10  3200.000000  308.929993
2020-07-13  3104.000000  299.411987
2020-07-14  3084.000000  303.359985
2020-07-15  3008.870117  309.201996

In [28]:
# 3. Pivot Table

In [29]:
pivot_table_df = pd.pivot_table(data=df, values='Close', index='Date', aggfunc='mean')

In [30]:
pivot_table_df.head(10)

                  Close
Date
2020-07-01  1551.312973
2020-07-02  1566.016022
2020-07-06  1665.678024
2020-07-07  1639.046051
2020-07-08  1677.143051
2020-07-09  1730.742935
2020-07-10  1754.464996
2020-07-13  1701.705994
2020-07-14  1693.679993
2020-07-15  1659.036057

In [45]:
import numpy as np
pivot_table_df = pd.pivot_table(data=df, values='Close', index='Symbol', aggfunc='mean', fill_value=np.mean(df['Close']))

In [46]:
pivot_table_df

              Close
Symbol
AMZN    3175.888562
TSLA     484.223836

In [33]:
pivot_table_df = pd.pivot_table(data=df, values='Close', index='Symbol', aggfunc=['mean', 'std', 'max', 'min'])

In [34]:
pivot_table_df

               mean         std          max          min
              Close       Close        Close        Close
Symbol
AMZN    3175.888562  116.057706  3531.449951  2878.699951
TSLA     484.223836  173.028402   883.090027   223.925995

In [36]:
# GROUP BY
# 1. splitting wrt Symbol
# 2. aggregate wrt mean
# 3. combine the results

In [39]:
group_df = df.groupby('Symbol')['Close'].mean().to_frame()

In [40]:
group_df

              Close
Symbol
AMZN    3175.888562
TSLA     484.223836

In [41]:
df_new_00 = df.groupby('Symbol').agg(
    {
        'Close': ['mean', 'median'],
        'Volume': ['max']
     }
)

In [42]:
df_new_00

              Close                    Volume
               mean       median          max
Symbol
AMZN    3175.888562  3167.459961    8892600.0
TSLA     484.223836   425.679993  222126200.0

In [43]:
df.groupby('Symbol')['Close'].agg(['mean', 'median'])

               mean       median
Symbol
AMZN    3175.888562  3167.459961
TSLA     484.223836   425.679993